# Google Colab Notebook

In [1]:
a=5
print(a)

5

In [1]:
import numpy as np
import pandas as pd

In [6]:
arr=np.array([1,2,3])
print(arr)

[1 2 3]

In [2]:
# A New Dirty Dataset 
data = {
    'Make': ['Toyota', 'Honda', 'Ford', 'BMW', 'Nissan', np.nan, 'Honda', 'Ford', 'Toyota', 'Nissan'],
    'Price': ['$4,000', '$5,000', '$12,000', '$22,000', '$3,500', '$7,000', np.nan, '$4,500', '$6,200', '$9,000'],
    'Odometer (KM)': [150043, 87899, 32549, 11179, 213095, np.nan, 45698, 60000, 31600, 85000],
    'Doors': ['4', '4', '2', '5', '4', '4', '4', '2', np.nan, '4']
}

df = pd.DataFrame(data)

In [4]:
df

     Make    Price  Odometer (KM) Doors
0  Toyota   $4,000       150043.0     4
1   Honda   $5,000        87899.0     4
2    Ford  $12,000        32549.0     2
3     BMW  $22,000        11179.0     5
4  Nissan   $3,500       213095.0     4
5     NaN   $7,000            NaN     4
6   Honda      NaN        45698.0     4
7    Ford   $4,500        60000.0     2
8  Toyota   $6,200        31600.0   NaN
9  Nissan   $9,000        85000.0     4

In [5]:
df.dtypes

Make              object
Price             object
Odometer (KM)    float64
Doors             object
dtype: object

In [ ]:
df["Price"]=df["Price"].str.replace(r'[\$,]','',regex=True)
df["Price"]=pd.to_numeric(df["Price"],errors="coerce")
df["Price"]=df["Price"].fillna(df["Price"].mean())
df["Price"]=df["Price"].astype(int)
df["Price"]

0     4000
1     5000
2    12000
3    22000
4     3500
5     7000
6     8133
7     4500
8     6200
9     9000
Name: Price, dtype: int64